Docs fixes, telegram.me rollback
